---
title:  最近关于工作的一些思考
date:   2021-04-24
categories: [misc]
tags: [misc]
---
**不忘初心**
做这份工作，这些项目的目的是什么？
难道不是研究新方法和技术本身的快乐吗？
难道不是搞清楚究竟新方法能不能work和解决实际问题的快乐吗?
在这个过程中，追寻着自己的好奇，本着诚实和解决问题的初衷，去享受进一寸自有进一寸的快乐。
不要预设结果，不要想一定要进production，一定要有impact。没有也没有关系，无非就是rating低一点，升职慢一点，bonus少一点！这些从长期事业角度来说一点也不重要。
别忘初心，别忘为什么你做这个行业。乐观积极前行，开开心心做事，保持孩子的好奇心和新鲜感：）
这也会是解决你的疲惫和焦虑的灵丹妙药。
加油！

**直面挑战和恐惧**
每一次有新的挑战到来，最好的解决办法就是迎难而上，立即去解决。
越正面面对挑战，它就越不可怕。你会逐渐看清它其实并不那么面目可憎，甚至还会有些可爱。你的创造力和才能会不断涌出，把困难和挑战一点点breakdown成没有那么可怕的小任务。你会看清如何解决这个挑战。
另一方面，拖拉和回避只会让这个挑战和伴随而来的无形的恐惧越长越大，越积越多，无形而又实实在在让你感到焦虑，疲惫；影响你的心理健康和效率。
所以，不管是新的信息，新的任务，新的不好的实验结果，新的难搞的人，都不要害怕也不要回避。迅速而冷静思考优先级和应对策略，并开始着手去解决!

**模块化工作**
我的工作性质需要不断研究创新，需要技术和执行，也需要对项目的战略和方向的思考。每一个方面性质不同，但都需要深度思考和专注。
另一方面，我也要认识到自己身体的特点和极限。从经验来看，早晨是头脑最清醒最活跃的时候，适合做战略思考和方法创新；下午往往是会最多的时候，适合开会，和人交流，回复信息，以及处理事务性工作；晚上最适合自己做技术类的工作，譬如写程序，跑实验。
模块化的工作的好处是: 
1. 在模块之内专注于某一个性质的工作，思维模式和习惯固定
2. 减少context switching，有助于深度思考和专注
3. 在模块之间可以转换模式，模块之外可以集中处理事务性工作和开会，保持了一定的自由度
为了利用好模块化工作，需要做到:
1. 在模块之内专注于眼前的工作，不要回信息，不要看邮件，拒绝打扰
2. 为每一个模块设定一个小目标去达到
3. 只在专门的时间去回信息/看帖子/回邮件
	
